[
  {
    "path": "posts/2021-08-15-visual-project-deliverible/",
    "title": "IAT - a Shiny App for Incident Analysis Tools with visual analytics ",
    "description": "The project is a partial answer to the VAST challenge 2021 in which a fictional incident happened in Kronos, a fictional island country. Employees from GASTech, an oil company having site in Kronos, went missing during a celebration event. A grassroot activist group, Protectors of Kronos, were suspected to be responsible for the kidnap. By conducting various visual analysis and implementing a shiny web app **IAT**, the project aims to gain  understanding of the people potentially involved in the incident and the details of the incident. There are 3 parts of the analysis, network analysis of GASTech employee, pattern detection through car route of GASTech employee, and text analysis of microblogs in social media. The analysis results were displayed with visualization from Shiny App.",
    "author": [
      {
        "name": "LU Di, MAO Xiaozhu, WANG Jiayi",
        "url": {}
      }
    ],
    "date": "2021-08-15",
    "categories": [],
    "contents": "\nThe project final Research paper can be found here\nMini-Challenge-1\nIn the side panel ,by selecting different employee names from the drop-down list, the employee profile and basic information will be displayed below.In the main panel of Email Network on the right, select a different employee ID from the drop-down list, and the employee’s network will appear. Each node in the network contains the employee’s name and job title, and the color of the node represents The employee’s department.\n\nIn the main panel of Email Detail, filter the required information by entering text in the search box. For example, enter the name of the employee who receives or sends emails, and the date and subject of the emails related to him can be displayed.\n\nMini-Challenge-2\nIn side panel,by changing the time range in slide bar and input specific car id, in the main panel ,the map will display the correspondent period and the car’s driving track.And the table will show the location of the car corresponding to the selected car id at different times.\nMini-Challenge-3\nIn the ‘Key word’ tab. By moving the slide bar in side panel,the word cloud graph in main panel will show different number of words in each word cloud graphs.By inputting different key word in text input box,the interactive bar chart in main panel will show micro blog message’s number containing key words over time.\n\nIn the ‘Microblog Table’ tab,we can change the topics number in topic modelling graph by moving ‘Topic Number’ slide bar to different value. Enter different text in the search box, you can filter out the messages that only contain specific keywords and the corresponding author and sending time. \n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-16T00:20:32+08:00",
    "input_file": "visual-project-deliverible.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Visual Analytics Project",
    "description": "Welcome to our new blog, Visual Analytics Project. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-19",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-06-19T15:40:14+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-19-project-proposal/",
    "title": "Project proposal",
    "description": "The project proposal for ISSS608-Visual Analytics",
    "author": [
      {
        "name": "Lu Di, Mao Xiaozhu, Wang Jiayi",
        "url": {}
      }
    ],
    "date": "2021-06-19",
    "categories": [],
    "contents": "\n\nContents\nUnderstanding the story behind missing GASTech employeeBackgroud, Motivation and Objective\nTasks and analysisMini challenge 1 - Xiaozhu\nMini challenge 2 - Jiayi\nMini challange 3 - Lu Di\n\nMilestones\n\n\nUnderstanding the story behind missing GASTech employee\nThe project will use data from VAST challenge 2021 which the scenario, people, places, technologies are fictitious.The data used in the project, such as news article, resume, micro-blog posts are fictitious too.\nBackgroud, Motivation and Objective\nThere are two fictitious countries involved in the project setting, Kronos and Tethys. They are both located around Mediterranean Sea. Tethys is a modern country, an economic leader and a key member of Europe’s economic, political, and defense organizations. On the contrary, Kronos is a country struggling with poverty with 70% of the population below poverty line. GASTech is a Tethys owned company operating natural gas production in Kronos. Employees are from both Tethys and Kronos with diverse background.\nIn 2014, in the midst of celebrating GASTech IPO, several employees went missing. A political activist organization, Protectors Of Kronos(POK) was suspected to be in the disappearance.\nAs data analysts specialized in visual analytics, we are helping law enforcement to dive into details and piece together the story of disappearance.\nLooking through resumes, past news articles, email conversation headers within GASTech to find out the relationship among the people and organizations. Organizations include GASTech, POK, the APA. The sub-task aims to provide background information of the kidnap and hint of suspicious people for further investigation.\nWith GPS tracking data of GASTech cars provided to the employee, credit card transactions, and loyalty card usage, this sub-task aims to identify any suspicious itinerary and behaviors.\nGiven collection of microblogs and emergency calls from the days surrounding the disappearance, we will use text analytics to evaluate the changing level of risk over time.\nTasks and analysis\nDuring the first state, the sub tasks will be distributed among the group members. Each member will take on 1 task. In the second stage, all analysis and visualization will be combined to create a final dashboard using R Shiny.\nMini challenge 1 - Xiaozhu\nTask and approach\nThere are 3 categories of data provided for the mini challenge, email conversation headers, employee resume, current and past news article.\nExtract sender and receiver in email headers and construct a graph\nAnalyze bias in news through opinion analysis against POK, government and GASTech in each news source.\nAnalyze and investigate resumes in which some or all of the words from “GASTech”, “APA” are mentioned to find potential people who are affiliated with more than 1 organization.\nAnalyze the newspaper article in which 1 or more of the 36 employees from GASTech is mentioned, especially for articles in 2014 when the incident happened.\nLook for cross reference between newspaper and find if there is any dependency among the news data source.\nData Source\nData can be downloaded from VAST mini-challange 2.\nA map of the fictitious Mediterranean island of Kronos\nDescriptions of the countries of Kronos and Tethys\nA chart describing the Kronos-based GASTech organization\nA spreadsheet of GASTech employee records\nResumes and short biographies of many, but not all, of the GASTech employees\nHistorical reports about the POK\nRelevant current and historical news reports from multiple domestic and translated foreign sources\nEmail headers from two weeks of internal GASTech company email\nTools to be used:\ntm: Text mining operations like removing numbers, special characters, punctuation and stop words.stringr: To parse text data into dataframesopenNLP: Apache OpenNLP is widely used for most common tasks in NLP, such as tokenization, POS tagging, named entity recognition (NER), chunking, parsing, and so on.tidyverse: For data wranglingggplot: For visualizing results\nExpected Outputs\nA graph of employee relationship through emails.\nClustering of news data source based on polarity sentiment score/opinion mining against “POK” and “Government”.\nNews article in which GASTech employee is mentioned, providing snippets of the article in dashboard.\nMini challenge 2 - Jiayi\ntask and approach\nMany of the Abila, Kronos-based employees of GAStech have company cars which are approved for both personal and business use. Those who do not have company cars have the ability to check out company trucks for business use, but these trucks cannot be used for personal business.\nEmployees with company cars are happy to have these vehicles, because the company cars are generally much higher quality than the cars they would be able to afford otherwise. However, GAStech does not trust their employees. Without the employees? knowledge, GAStech has installed geospatial tracking software in the company vehicles. The vehicles are tracked periodically as long as they are moving.\n\nThis vehicle tracking data has been made available to law enforcement to support their investigation. Unfortunately, data is not available for the day the GAStech employees went missing. Data is only available for the two weeks prior to the disappearance.\nTo promote local businesses, Kronos based companies provide a Kronos Kares benefit card to GASTech employees giving them discounts and rewards in exchange for collecting information about their credit card purchases and preferences as recorded on loyalty cards. This data has been made available to investigators in the hopes that it can help resolve the situation. However, Kronos Kares does not collect personal information beyond purchases.\ndata source\nDownload From Official Site\nTable Header\nSecond Header\ncar-assignments.csv\nEmployee Last Name, Employee First Name, Car ID, Employment Type, Employment Title\ngps.csv\nTimestamp, Car ID, Latitude, Longitude\nloyalty_data.csv\nTimestamp, Location, Price, Loyalty Number\ncc_data.csv\nTimestamp, Location, Price, Last 4 digits of the credit or debit card number\nGeo Data\nESRI shapefiles of Abila and Kronos\n\ntools to use\nThis sub-project will fully conduct under R language. This task will be realized by coding with algorithm and some official packages to achieve the final goal. Following are some packages for example:\nsp:Classes and methods for spatial data.\nsf:A package that provides simple features access for R.\nspdep:A collection of functions to create spatial weights matrix objects from polygon ‘contiguities’, from point patterns by distance and tessellations.\nmaptools:Set of tools for manipulating geographic data.\nraster:Reading, writing, manipulating, analyzing and modeling of spatial data.\ntidyverse:The tidyverse is an opinionated collection of R packages designed for data science.\nexpected output\nBasic task\nUsing just the credit and loyalty card data, identify the most popular locations, and when they are popular. Try to find the anomalies and give recommends to correct these anomalies.\nInfer the owners of each credit card and loyalty card.\n\nAdvanced task\nAdd the vehicle data to analysis of the credit and loyalty card data. Find the anomalies in question 1 based on the new data. Find discrepancies between vehicle, credit, and loyalty card data.\nBased on the data sources provided, identify potential informal or unofficial relationships among GASTech personnel.\nFind evidence of suspicious activity and identify 1- 10 locations where might be occurring suspicious activity.\n\nMini challange 3 - Lu Di\nTask and approach:\nOn January 23, 2014, multiple events unfolded in Abila. We are performing a retrospective analysis based on limited information about what took place. My goal is to identify risks and find potential ways to mitigate the risk effectively.\nBase on the data provided, we will evaluate the changing levels of risk to the public and find effective action to avoid things that endanger public safety.\nData Source\nChallenge 3 provides two kinds of texts. One is a collection of Microblog which has been identified by automated filters as potentially relevant to the ongoing incident. The other is Text transcripts of emergency dispatches by the Abila, Kronos local police and fire departments.\nTools will be used\nR has a rich set of packages for Natural Language Processing (NLP) and generating plots.In challenge 3 we may use the R packages below to achieve different functions.\ntm: Text mining operations like removing numbers, special characters, punctuation and stop words.\nsnowballc: For stem the word to reducing words to their base or root form.\nwordcloud：For generating the word cloud plot.\nsyuzhet: For sentiment scores and emotion classification\nggplot: To visualize our analyze result by all kinds of plot.\nExpected Outputs\nAccording to the text analysis and visualization results on Microblog and Text transcripts on January 23, 2014 17:00 to 21:31 to find out highly possible incident to happen in the future days in Abila, Kronos. With the analysis result, we will propose effective action to stop such incident from happening.\nMilestones\n\n\n\n",
    "preview": {},
    "last_modified": "2021-06-20T18:49:17+08:00",
    "input_file": "project-proposal.knit.md"
  }
]
